import math
radius = float(input("Введите радиус круга в сантиметрах "))

lenght = 2*math.pi*radius #формула нахождения длины окружности
area = math.pi * radius**2 #формула нахождения площади окружности
print(f"Длина окружности: {int(lenght/100)} метров и {int(lenght%100)} сантиметра")
print(f"Площадь окружности: {int(area/10000)} метров квадратных и {int(area%10000)} сантиметра")

squareV = radius * (2**0.5)#формула нахождения длины стороны квадрата , вписанного в окружность
triangleV = radius * (3**0.5)#формула нахождения длины стороны равностороннего треугольника , вписанного в окружность
print(f"Длина стороны квадрата , вписанного в окружность: {int(squareV /100)} метров и {int(squareV %100)} сантиметра")
print(f"Длина стороны равностороннего треугольника , вписанного в окружность: {int(triangleV/100)} метров и {int(triangleV%100)} сантиметра")

squareO = radius * 2 #формула нахождения длины стороны квадрата , описанного около окружности
triangleO = 2 * radius * (3**0.5) #формула нахождения длины стороны равностороннего треугольника , описанного около окружности
eightUgol = 2 * radius * (2**0.5 - 1) #формула нахождения длины стороны правильного восьмиугольника  , описанного около окружности
print(f"Длина стороны квадрата , описанного около окружности: {int(squareO /100)} метров и {int(squareO %100)} сантиметра")
print(f"Длина стороны равностороннего треугольника , описанного около окружности: {int(triangleO/100)} метров и {int(triangleO%100)} сантиметра")
print(f"Длина стороны правильного восьмиугольника , описанного около окружности: {int(eightUgol/100)} метров и {int(eightUgol%100)} сантиметра")

